<?php
return [
    'encrypt_res' => [
        'key' => env('EEA_KEY_FOR_ENCRYPT'),
        'cipher' => 'AES-256-CBC'
    ],
    'decrypt_req' => [
        /**
         * ----------------------------------------------------------------
         * Tên trường dữ liệu đã được mã hoá do client gửi lên
         * ----------------------------------------------------------------
         */
        'encrypted_data_name' => 'encrypted_data',

        /**
         * ----------------------------------------------------------------
         * Số bits để tạo key: 1024, 2048, 3072, 4096
         * ----------------------------------------------------------------
         */
        'bits' => 4096,

        /**
         * ----------------------------------------------------------------
         * Đường dẫn file key tính từ thư mục gốc
         * ----------------------------------------------------------------
         */
        'path_key' => [
            'public_key' => env('EEA_PUBLIC_KEY_PATH', ''),
            'private_key' => env('EEA_PRIVATE_KEY_PATH', ''),
        ]
    ]
];
